//
//  main.cpp
//  Lab1-#1-V2.0
//
//  Created by Александр Ноянов on 11/02/2019.
//  Copyright © 2019 MPEI. All rights reserved.
//

#include <iostream>

using namespace std;

/*
 
 Задание №2.
 Для кодирования строки равномерным двоичным кодом, например, для слова «машина», алфавит: м,а,ш,н,и – 5 букв, достаточно 3 бита.
 Кодовый словарь:
 М    001
 А    010
 Ш    011
 И    100
 Н    101
 Слово «машина» кодируется сообщением 001010011100101010.
 Составить программу, которая кодирует строку любой длины, составляет  кодовый словарь  и выводит закодированное сообщение
 
 */

int main(int argc, const char * argv[]) {
    // insert code here...
    //std::cout << "Hello, World!\n";
    
    cout << "   ==== Lab1 #2 ====" << endl;
    cout << ">";
    string strIn;
    cin >> strIn;
    
    
    
    
    return 0;
}
